
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do merge.do 

. * read EU groups of countries
. import delimited "temp/eu-related-countries.csv", varnames(1) clear
(3 vars, 56 obs)

. tempfile eu

. 
. clonevar iso2_o = iso_3166_2

. clonevar iso2_d = iso_3166_2

. save `eu'
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St01646.000001 saved

. 
. use "temp/trade-similarity-clean.dta", clear

. count
  119,952

. 
. * is the exporter an EU country?
. merge m:1 iso2_o using `eu', nogen keep(match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           111,384  
    -----------------------------------------

. rename relation eu_relation_exporter

. * is the importer an EU country?
. merge m:1 iso2_d using `eu', nogen keep(match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            22,984  
    -----------------------------------------

. rename relation eu_relation_importer

. 
. merge 1:1 iso2_o iso2_d year using "temp/aggregated-clean.dta", nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                        79,993
        from master                       352  
        from using                     79,641  

    matched                            22,632  
    -----------------------------------------

. 
. merge m:1 iso2_o iso2_d using "temp/geodist-clean.dta", keepusing(iso3_o iso3
> _d ///
> iso3_od contig-distwces distwces area_o dis_int_o landlocked_o ///
> continent_o city_en_o area_d dis_int_d landlocked_d continent_d city_en_d) ke
> ep(1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                         8,383
        from master                     8,383  
        from using                          0  

    matched                            94,242  
    -----------------------------------------

. 
. merge m:1 iso3_od year using "temp/gdelt-clean.dta", // keep(3) nogen
(note: variable year was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       110,650
        from master                    96,499  (_merge==1)
        from using                     14,151  (_merge==2)

    matched                             6,126  (_merge==3)
    -----------------------------------------

. 
. tab year _merge

           |              _merge
      year | master on  using onl  matched ( |     Total
-----------+---------------------------------+----------
      2001 |     5,941          0          0 |     5,941 
      2002 |     5,991          0          0 |     5,991 
      2003 |     5,931          0          0 |     5,931 
      2004 |     6,010          0          0 |     6,010 
      2005 |     5,993          0          0 |     5,993 
      2006 |     5,997          0          0 |     5,997 
      2007 |     5,982          0          0 |     5,982 
      2008 |     5,986          0          0 |     5,986 
      2009 |     5,946          0          0 |     5,946 
      2010 |     5,966          0          0 |     5,966 
      2011 |     6,016          0          0 |     6,016 
      2012 |     6,046          0          0 |     6,046 
      2013 |     6,110          0          0 |     6,110 
      2014 |     6,129          0          0 |     6,129 
      2015 |     4,113      1,473      2,044 |     7,630 
      2016 |     4,191      1,478      2,039 |     7,708 
      2017 |     4,151      1,474      2,043 |     7,668 
      2018 |         0      3,242          0 |     3,242 
      2019 |         0      3,242          0 |     3,242 
      2020 |         0      3,242          0 |     3,242 
-----------+---------------------------------+----------
     Total |    96,499     14,151      6,126 |   116,776 

. tab year _merge if tci_ != .

           |        _merge
      year | master on  matched ( |     Total
-----------+----------------------+----------
      2001 |     1,277          0 |     1,277 
      2002 |     1,277          0 |     1,277 
      2003 |     1,284          0 |     1,284 
      2004 |     1,288          0 |     1,288 
      2005 |     1,304          0 |     1,304 
      2006 |     1,307          0 |     1,307 
      2007 |     1,338          0 |     1,338 
      2008 |     1,343          0 |     1,343 
      2009 |     1,343          0 |     1,343 
      2010 |     1,345          0 |     1,345 
      2011 |     1,343          0 |     1,343 
      2012 |     1,349          0 |     1,349 
      2013 |     1,344          0 |     1,344 
      2014 |     1,347          0 |     1,347 
      2015 |       533        816 |     1,349 
      2016 |       531        816 |     1,347 
      2017 |       532        816 |     1,348 
-----------+----------------------+----------
     Total |    20,085      2,448 |    22,533 

. 
. keep if _merge == 3
(110,650 observations deleted)

. drop _merge

. 
. count
  6,126

. 
. preserve

. foreach type in o d {
  2.         use "temp/qog-clean.dta", clear
  3. 
.         rename ccodealp iso3
  4.         
.         foreach var of varlist _all {
  5.                 rename `var' `var'_`type'
  6.         }
  7.         
.         rename year_`type' year
  8. 
.         tempfile political_`type'
  9.         save `political_`type''
 10. }
(Quality of Government Basic dataset 2020 - Time-Series)
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St01646.000003 saved
(Quality of Government Basic dataset 2020 - Time-Series)
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St01646.000004 saved

. restore

. 
. merge m:1 iso3_o year using `political_o', nogen keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                             3
        from master                         3  
        from using                          0  

    matched                             6,123  
    -----------------------------------------

. merge m:1 iso3_d year using `political_d', nogen keep(1 3)
(label wr_regt already defined)
(label yesno already defined)
(label govstruct already defined)
(label lelecsystem already defined)
(label ht_colonial already defined)
(label ht_region already defined)
(label regtypeny already defined)
(label regimeny already defined)
(label slavel already defined)
(label yes_no_other1 already defined)
(label yes_no_other already defined)
(label SAX2014 already defined)
(label chga already defined)
(label gov_type already defined)
(label valname already defined)
(label gol_est_spec_lab already defined)
(label gol_est_lab already defined)
(label gol_pr_la already defined)
(label regimetype already defined)
(label lp_legorlabel already defined)
(label nelda already defined)
(label Watts2 already defined)
(label elecfam72_04 already defined)
(label vi_wcoord already defined)
(label vi_rsm already defined)
(label vi_rsg already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           262
        from master                       262  
        from using                          0  

    matched                             5,864  
    -----------------------------------------

. 
. count
  6,126

. 
. foreach var in intent_events visits_events intent_mentions visits_mentions {
  2.         gen `var'_exporter = cond(iso3_o == actor1, `var'1, `var'2)
  3.         drop `var'1 `var'2
  4. }
(60 missing values generated)
(60 missing values generated)
(60 missing values generated)
(60 missing values generated)

. 
. gen dem_diff = abs(fh_ipolity2_o - fh_ipolity2_d)
(265 missing values generated)

. 
. save "output/analysis-sample.dta", replace
file output/analysis-sample.dta saved

. 
end of do-file
