
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

6-user Stata network perpetual license:
       Serial number:  501606204656
         Licensed to:  Miklos Koren
                       Central European University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.

. do merge.do 

. use "temp/trade-similarity-clean.dta", clear

. 
. count
  119,952

. 
. merge 1:1 iso2_o iso2_d year using "temp/aggregated-clean.dta", nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                        18,637
        from master                    18,158  
        from using                        479  

    matched                           101,794  
    -----------------------------------------

. 
. merge m:1 iso2_o iso2_d using "temp/geodist-clean.dta", keepusing(iso3_o iso3
> _d ///
> iso3_od contig-distwces distwces area_o dis_int_o landlocked_o ///
> continent_o city_en_o area_d dis_int_d landlocked_d continent_d city_en_d) ke
> ep(1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                        17,139
        from master                    17,139  
        from using                          0  

    matched                           103,292  
    -----------------------------------------

. 
. merge m:1 iso3_od year using "temp/gdelt-clean.dta", // keep(3) nogen
(note: variable year was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       128,432
        from master                   114,293  (_merge==1)
        from using                     14,139  (_merge==2)

    matched                             6,138  (_merge==3)
    -----------------------------------------

. 
. tab year _merge

           |              _merge
      year | master on  using onl  matched ( |     Total
-----------+---------------------------------+----------
      2001 |     7,084          0          0 |     7,084 
      2002 |     7,084          0          0 |     7,084 
      2003 |     7,085          0          0 |     7,085 
      2004 |     7,085          0          0 |     7,085 
      2005 |     7,084          0          0 |     7,084 
      2006 |     7,084          0          0 |     7,084 
      2007 |     7,084          0          0 |     7,084 
      2008 |     7,084          0          0 |     7,084 
      2009 |     7,084          0          0 |     7,084 
      2010 |     7,085          0          0 |     7,085 
      2011 |     7,084          0          0 |     7,084 
      2012 |     7,084          0          0 |     7,084 
      2013 |     7,084          0          0 |     7,084 
      2014 |     7,084          0          0 |     7,084 
      2015 |     5,038      1,471      2,046 |     8,555 
      2016 |     5,038      1,471      2,046 |     8,555 
      2017 |     5,038      1,471      2,046 |     8,555 
      2018 |         0      3,242          0 |     3,242 
      2019 |         0      3,242          0 |     3,242 
      2020 |         0      3,242          0 |     3,242 
-----------+---------------------------------+----------
     Total |   114,293     14,139      6,138 |   134,570 

. tab year _merge if tci_ != .

           |        _merge
      year | master on  matched ( |     Total
-----------+----------------------+----------
      2001 |     5,403          0 |     5,403 
      2002 |     5,454          0 |     5,454 
      2003 |     5,457          0 |     5,457 
      2004 |     5,562          0 |     5,562 
      2005 |     5,614          0 |     5,614 
      2006 |     5,671          0 |     5,671 
      2007 |     5,671          0 |     5,671 
      2008 |     5,674          0 |     5,674 
      2009 |     5,668          0 |     5,668 
      2010 |     5,692          0 |     5,692 
      2011 |     5,738          0 |     5,738 
      2012 |     5,781          0 |     5,781 
      2013 |     5,875          0 |     5,875 
      2014 |     5,905          0 |     5,905 
      2015 |     3,915      2,034 |     5,949 
      2016 |     3,988      2,030 |     6,018 
      2017 |     3,958      2,033 |     5,991 
-----------+----------------------+----------
     Total |    91,026      6,097 |    97,123 

. 
. keep if _merge == 3
(128,432 observations deleted)

. drop _merge

. 
. count
  6,138

. 
. preserve

. foreach type in o d {
  2.         use "temp/qog-clean.dta", clear
  3. 
.         rename ccodealp iso3
  4.         
.         foreach var of varlist _all {
  5.                 rename `var' `var'_`type'
  6.         }
  7.         
.         rename year_`type' year
  8. 
.         tempfile political_`type'
  9.         save `political_`type''
 10. }
(Quality of Government Basic dataset 2020 - Time-Series)
file /home/tmp/St30708.000002 saved
(Quality of Government Basic dataset 2020 - Time-Series)
file /home/tmp/St30708.000003 saved

. restore

. 
. merge m:1 iso3_o year using `political_o', nogen keep(1 3)

    Result                           # of obs.
    -----------------------------------------
    not matched                             3
        from master                         3  
        from using                          0  

    matched                             6,135  
    -----------------------------------------

. merge m:1 iso3_d year using `political_d', nogen keep(1 3)
(label wr_regt already defined)
(label yesno already defined)
(label govstruct already defined)
(label lelecsystem already defined)
(label ht_colonial already defined)
(label ht_region already defined)
(label regtypeny already defined)
(label regimeny already defined)
(label slavel already defined)
(label yes_no_other1 already defined)
(label yes_no_other already defined)
(label SAX2014 already defined)
(label chga already defined)
(label gov_type already defined)
(label valname already defined)
(label gol_est_spec_lab already defined)
(label gol_est_lab already defined)
(label gol_pr_la already defined)
(label regimetype already defined)
(label lp_legorlabel already defined)
(label nelda already defined)
(label Watts2 already defined)
(label elecfam72_04 already defined)
(label vi_wcoord already defined)
(label vi_rsm already defined)
(label vi_rsg already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           264
        from master                       264  
        from using                          0  

    matched                             5,874  
    -----------------------------------------

. 
. count
  6,138

. 
. save "output/analysis-sample.dta", replace
file output/analysis-sample.dta saved

. 
end of do-file
